espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_se_driver_signature.c
/***************************************************************************//**
 * @file
 * @brief Silicon Labs PSA Crypto Secure Engine Signature Driver functions.
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#include "em_device.h"

#if defined(SEMAILBOX_PRESENT)

#include "psa/crypto.h"
#include "sli_se_transparent_types.h"
#include "sli_se_transparent_functions.h"
#include "sli_se_driver_key_management.h"
#include "sli_se_version_dependencies.h"

#if defined(SLI_PSA_WANT_ALG_ECDSA) || defined(SLI_PSA_WANT_ALG_EDDSA)
#include "sl_se_manager.h"
#include "sli_se_manager_internal.h"
#include "sl_se_manager_signature.h"
#include <string.h>
#endif

/*******************************************************************************
 * Statics *
 ******************************************************************************/

#if defined(SLI_PSA_WANT_ALG_ECDSA) || defined(SLI_PSA_WANT_ALG_EDDSA)

/**
 * @brief
 *   Validate that the curve and algorithm combination is supported by hardware
 */
static psa_status_t
check_curve_availability(const psa_key_attributes_t *attributes,
                         psa_algorithm_t alg)
{
  psa_key_type_t key_type = psa_get_key_type(attributes);
  psa_ecc_family_t curvetype = PSA_KEY_TYPE_ECC_GET_FAMILY(key_type);

#if defined(SLI_PSA_WANT_ALG_ECDSA)
  if (curvetype == PSA_ECC_FAMILY_SECP_R1) {
    switch (psa_get_key_bits(attributes)) {
      #if defined(PSA_WANT_ECC_SECP_R1_192)
      case 192: // Intentional
      #endif // PSA_WANT_ECC_SECP_R1_192
      #if (_SILICON_LABS_32B_SERIES_2_CONFIG >= 3)
      #if defined(PSA_WANT_ECC_SECP_R1_224)
      case 224: // Intentional
      #endif // PSA_WANT_ECC_SECP_R1_224
      #endif // (_SILICON_LABS_32B_SERIES_2_CONFIG >= 3)
      #if defined(PSA_WANT_ECC_SECP_R1_256)
      case 256: // Intentional
      #endif // PSA_WANT_ECC_SECP_R1_256
      #if (_SILICON_LABS_SECURITY_FEATURE == _SILICON_LABS_SECURITY_FEATURE_VAULT)
      #if defined(PSA_WANT_ECC_SECP_R1_384)
      case 384: // Intentional
      #endif // PSA_WANT_ECC_SECP_R1_384
      #if defined(PSA_WANT_ECC_SECP_R1_521)
      case 521: // Intentional
      #endif // PSA_WANT_ECC_SECP_R1_521
      #endif // VAULT
      // Only randomized ECDSA is supported on secp-r1 curves
      if (!PSA_ALG_IS_RANDOMIZED_ECDSA(alg)) {
        return PSA_ERROR_NOT_SUPPORTED;
      }
      break;   // This break catches all the supported curves
      default:
        return PSA_ERROR_NOT_SUPPORTED;
    }
  } else if (curvetype == PSA_ECC_FAMILY_SECP_K1) {
    // Only randomized ECDSA is supported on secp-k1 curves
    if (!PSA_ALG_IS_RANDOMIZED_ECDSA(alg)) {
      return PSA_ERROR_NOT_SUPPORTED;
    }
    // TODO: introduce custom domains to enable secpxxxk1
    return PSA_ERROR_NOT_SUPPORTED;
  } else
#endif // SLI_PSA_WANT_ALG_ECDSA
#if defined(SLI_PSA_WANT_ALG_EDDSA)
  if (curvetype == PSA_ECC_FAMILY_TWISTED_EDWARDS) {
    switch (psa_get_key_bits(attributes)) {
      #if defined(PSA_WANT_ECC_TWISTED_EDWARDS_255)
      case 255:
        // Only Ed25519 is supported (and only in context of EdDSA)
        if (alg != PSA_ALG_PURE_EDDSA) {
          return PSA_ERROR_NOT_SUPPORTED;
        }
        break;
      #endif
      default:
        return PSA_ERROR_NOT_SUPPORTED;
    }
  } else
#endif // SLI_PSA_WANT_ALG_EDDSA
  {
    (void) alg;
    return PSA_ERROR_NOT_SUPPORTED;
  }
  return PSA_SUCCESS;
}

static sl_se_hash_type_t get_hash_for_algorithm(psa_algorithm_t alg)
{
#if defined(SLI_PSA_WANT_ALG_EDDSA)
  if (alg == PSA_ALG_PURE_EDDSA) {
    // The hash alg parameter is ignored for EdDSA, as it is decided uniqely by
    // the alorithm. Return magic value which isn't SL_SE_HASH_NONE.
    return (sl_se_hash_type_t)255;
  }
#endif // SLI_PSA_WANT_ALG_EDDSA

  switch (PSA_ALG_SIGN_GET_HASH(alg)) {
    #if defined(PSA_WANT_ALG_SHA_1)
    case PSA_ALG_SHA_1:
      return SL_SE_HASH_SHA1;
    #endif // PSA_WANT_ALG_SHA_1
    #if defined(PSA_WANT_ALG_SHA_224)
    case PSA_ALG_SHA_224:
      return SL_SE_HASH_SHA224;
    #endif // PSA_WANT_ALG_SHA_224
    #if defined(PSA_WANT_ALG_SHA_256)
    case PSA_ALG_SHA_256:
      return SL_SE_HASH_SHA256;
    #endif // PSA_WANT_ALG_SHA_256
    #if (_SILICON_LABS_SECURITY_FEATURE == _SILICON_LABS_SECURITY_FEATURE_VAULT)
    #if defined(PSA_WANT_ALG_SHA_384)
    case PSA_ALG_SHA_384:
      return SL_SE_HASH_SHA384;
    #endif // PSA_WANT_ALG_SHA_384
    #if defined(PSA_WANT_ALG_SHA_512)
    case PSA_ALG_SHA_512:
      return SL_SE_HASH_SHA512;
    #endif // PSA_WANT_ALG_SHA_512
    #endif // Vault High
    default:
      return SL_SE_HASH_NONE;
  }
}

#endif // SLI_PSA_WANT_ALG_ECDSA || SLI_PSA_WANT_ALG_EDDSA

/*******************************************************************************
 * Driver functions *
 ******************************************************************************/

/**
 * \brief Sign a full message with a private key.
 *
 * \param[in]  attributes       The attributes of the ECC key to use for the
 *                              operation.
 * \param[in]  key_buffer       The buffer containing the ECC key context.
 *                              format.
 * \param[in]  key_buffer_size  Size of the \p key_buffer buffer in bytes.
 * \param      alg              A signature algorithm that is compatible with
 *                              the type of \p handle.
 * \param[in]  input            The hash or message to sign.
 * \param      input_length     Size of the \p hash buffer in bytes.
 * \param[out] signature        Buffer where the signature is to be written.
 * \param      signature_size   Size of the \p signature buffer in bytes.
 * \param[out] signature_length On success, the number of bytes
 *                              that make up the returned signature value.
 */
psa_status_t sli_se_sign_message(const psa_key_attributes_t *attributes,
                                 const uint8_t *key_buffer,
                                 size_t key_buffer_size,
                                 psa_algorithm_t alg,
                                 const uint8_t *input,
                                 size_t input_length,
                                 uint8_t *signature,
                                 size_t signature_size,
                                 size_t *signature_length)
{
#if (defined(SLI_PSA_WANT_ALG_ECDSA) || defined(SLI_PSA_WANT_ALG_EDDSA)) \
  && defined(PSA_WANT_KEY_TYPE_ECC_KEY_PAIR)

